GopalSaraf/Practicals/PSDL/include/proc/pic16f916.inc
// Register: EEDATL
#define EEDATL EEDATL
EEDATL                                   equ 010Ch
// bitfield definitions
EEDATL_EEDATL_POSN                       equ 0000h
EEDATL_EEDATL_POSITION                   equ 0000h
EEDATL_EEDATL_SIZE                       equ 0008h
EEDATL_EEDATL_LENGTH                     equ 0008h
EEDATL_EEDATL_MASK                       equ 00FFh
EEDATL_EEDATL0_POSN                      equ 0000h
EEDATL_EEDATL0_POSITION                  equ 0000h
EEDATL_EEDATL0_SIZE                      equ 0001h
EEDATL_EEDATL0_LENGTH                    equ 0001h
EEDATL_EEDATL0_MASK                      equ 0001h
EEDATL_EEDATL1_POSN                      equ 0001h
EEDATL_EEDATL1_POSITION                  equ 0001h
EEDATL_EEDATL1_SIZE                      equ 0001h
EEDATL_EEDATL1_LENGTH                    equ 0001h
EEDATL_EEDATL1_MASK                      equ 0002h
EEDATL_EEDATL2_POSN                      equ 0002h
EEDATL_EEDATL2_POSITION                  equ 0002h
EEDATL_EEDATL2_SIZE                      equ 0001h
EEDATL_EEDATL2_LENGTH                    equ 0001h
EEDATL_EEDATL2_MASK                      equ 0004h
EEDATL_EEDATL3_POSN                      equ 0003h
EEDATL_EEDATL3_POSITION                  equ 0003h
EEDATL_EEDATL3_SIZE                      equ 0001h
EEDATL_EEDATL3_LENGTH                    equ 0001h
EEDATL_EEDATL3_MASK                      equ 0008h
EEDATL_EEDATL4_POSN                      equ 0004h
EEDATL_EEDATL4_POSITION                  equ 0004h
EEDATL_EEDATL4_SIZE                      equ 0001h
EEDATL_EEDATL4_LENGTH                    equ 0001h
EEDATL_EEDATL4_MASK                      equ 0010h
EEDATL_EEDATL5_POSN                      equ 0005h
EEDATL_EEDATL5_POSITION                  equ 0005h
EEDATL_EEDATL5_SIZE                      equ 0001h
EEDATL_EEDATL5_LENGTH                    equ 0001h
EEDATL_EEDATL5_MASK                      equ 0020h
EEDATL_EEDATL6_POSN                      equ 0006h
EEDATL_EEDATL6_POSITION                  equ 0006h
EEDATL_EEDATL6_SIZE                      equ 0001h
EEDATL_EEDATL6_LENGTH                    equ 0001h
EEDATL_EEDATL6_MASK                      equ 0040h
EEDATL_EEDATL7_POSN                      equ 0007h
EEDATL_EEDATL7_POSITION                  equ 0007h
EEDATL_EEDATL7_SIZE                      equ 0001h
EEDATL_EEDATL7_LENGTH                    equ 0001h
EEDATL_EEDATL7_MASK                      equ 0080h

// Register: EEADRL
#define EEADRL EEADRL
EEADRL                                   equ 010Dh
// bitfield definitions
EEADRL_EEADRL_POSN                       equ 0000h
EEADRL_EEADRL_POSITION                   equ 0000h
EEADRL_EEADRL_SIZE                       equ 0008h
EEADRL_EEADRL_LENGTH                     equ 0008h
EEADRL_EEADRL_MASK                       equ 00FFh
EEADRL_EEADRL0_POSN                      equ 0000h
EEADRL_EEADRL0_POSITION                  equ 0000h
EEADRL_EEADRL0_SIZE                      equ 0001h
EEADRL_EEADRL0_LENGTH                    equ 0001h
EEADRL_EEADRL0_MASK                      equ 0001h
EEADRL_EEADRL1_POSN                      equ 0001h
EEADRL_EEADRL1_POSITION                  equ 0001h
EEADRL_EEADRL1_SIZE                      equ 0001h
EEADRL_EEADRL1_LENGTH                    equ 0001h
EEADRL_EEADRL1_MASK                      equ 0002h
EEADRL_EEADRL2_POSN                      equ 0002h
EEADRL_EEADRL2_POSITION                  equ 0002h
EEADRL_EEADRL2_SIZE                      equ 0001h
EEADRL_EEADRL2_LENGTH                    equ 0001h
EEADRL_EEADRL2_MASK                      equ 0004h
EEADRL_EEADRL3_POSN                      equ 0003h
EEADRL_EEADRL3_POSITION                  equ 0003h
EEADRL_EEADRL3_SIZE                      equ 0001h
EEADRL_EEADRL3_LENGTH                    equ 0001h
EEADRL_EEADRL3_MASK                      equ 0008h
EEADRL_EEADRL4_POSN                      equ 0004h
EEADRL_EEADRL4_POSITION                  equ 0004h
EEADRL_EEADRL4_SIZE                      equ 0001h
EEADRL_EEADRL4_LENGTH                    equ 0001h
EEADRL_EEADRL4_MASK                      equ 0010h
EEADRL_EEADRL5_POSN                      equ 0005h
EEADRL_EEADRL5_POSITION                  equ 0005h
EEADRL_EEADRL5_SIZE                      equ 0001h
EEADRL_EEADRL5_LENGTH                    equ 0001h
EEADRL_EEADRL5_MASK                      equ 0020h
EEADRL_EEADRL6_POSN                      equ 0006h
EEADRL_EEADRL6_POSITION                  equ 0006h
EEADRL_EEADRL6_SIZE                      equ 0001h
EEADRL_EEADRL6_LENGTH                    equ 0001h
EEADRL_EEADRL6_MASK                      equ 0040h
EEADRL_EEADRL7_POSN                      equ 0007h
EEADRL_EEADRL7_POSITION                  equ 0007h
EEADRL_EEADRL7_SIZE                      equ 0001h
EEADRL_EEADRL7_LENGTH                    equ 0001h
EEADRL_EEADRL7_MASK                      equ 0080h

// Register: EEDATH
#define EEDATH EEDATH
EEDATH                                   equ 010Eh
// bitfield definitions
EEDATH_EEDATH0_POSN                      equ 0000h
EEDATH_EEDATH0_POSITION                  equ 0000h
EEDATH_EEDATH0_SIZE                      equ 0001h
EEDATH_EEDATH0_LENGTH                    equ 0001h
EEDATH_EEDATH0_MASK                      equ 0001h
EEDATH_EEDATH1_POSN                      equ 0001h
EEDATH_EEDATH1_POSITION                  equ 0001h
EEDATH_EEDATH1_SIZE                      equ 0001h
EEDATH_EEDATH1_LENGTH                    equ 0001h
EEDATH_EEDATH1_MASK                      equ 0002h
EEDATH_EEDATH2_POSN                      equ 0002h
EEDATH_EEDATH2_POSITION                  equ 0002h
EEDATH_EEDATH2_SIZE                      equ 0001h
EEDATH_EEDATH2_LENGTH                    equ 0001h
EEDATH_EEDATH2_MASK                      equ 0004h
EEDATH_EEDATH3_POSN                      equ 0003h
EEDATH_EEDATH3_POSITION                  equ 0003h
EEDATH_EEDATH3_SIZE                      equ 0001h
EEDATH_EEDATH3_LENGTH                    equ 0001h
EEDATH_EEDATH3_MASK                      equ 0008h
EEDATH_EEDATH4_POSN                      equ 0004h
EEDATH_EEDATH4_POSITION                  equ 0004h
EEDATH_EEDATH4_SIZE                      equ 0001h
EEDATH_EEDATH4_LENGTH                    equ 0001h
EEDATH_EEDATH4_MASK                      equ 0010h
EEDATH_EEDATH5_POSN                      equ 0005h
EEDATH_EEDATH5_POSITION                  equ 0005h
EEDATH_EEDATH5_SIZE                      equ 0001h
EEDATH_EEDATH5_LENGTH                    equ 0001h
EEDATH_EEDATH5_MASK                      equ 0020h

// Register: EEADRH
#define EEADRH EEADRH
EEADRH                                   equ 010Fh
// bitfield definitions
EEADRH_EEADRH0_POSN                      equ 0000h
EEADRH_EEADRH0_POSITION                  equ 0000h
EEADRH_EEADRH0_SIZE                      equ 0001h
EEADRH_EEADRH0_LENGTH                    equ 0001h
EEADRH_EEADRH0_MASK                      equ 0001h
EEADRH_EEADRH1_POSN                      equ 0001h
EEADRH_EEADRH1_POSITION                  equ 0001h
EEADRH_EEADRH1_SIZE                      equ 0001h
EEADRH_EEADRH1_LENGTH                    equ 0001h
EEADRH_EEADRH1_MASK                      equ 0002h
EEADRH_EEADRH2_POSN                      equ 0002h
EEADRH_EEADRH2_POSITION                  equ 0002h
EEADRH_EEADRH2_SIZE                      equ 0001h
EEADRH_EEADRH2_LENGTH                    equ 0001h
EEADRH_EEADRH2_MASK                      equ 0004h
EEADRH_EEADRH3_POSN                      equ 0003h
EEADRH_EEADRH3_POSITION                  equ 0003h
EEADRH_EEADRH3_SIZE                      equ 0001h
EEADRH_EEADRH3_LENGTH                    equ 0001h
EEADRH_EEADRH3_MASK                      equ 0008h
EEADRH_EEADRH4_POSN                      equ 0004h
EEADRH_EEADRH4_POSITION                  equ 0004h
EEADRH_EEADRH4_SIZE                      equ 0001h
EEADRH_EEADRH4_LENGTH                    equ 0001h
EEADRH_EEADRH4_MASK                      equ 0010h

// Register: LCDDATA0
#define LCDDATA0 LCDDATA0
LCDDATA0                                 equ 0110h
// bitfield definitions
LCDDATA0_SEG0_POSN                       equ 0000h
LCDDATA0_SEG0_POSITION                   equ 0000h
LCDDATA0_SEG0_SIZE                       equ 0001h
LCDDATA0_SEG0_LENGTH                     equ 0001h
LCDDATA0_SEG0_MASK                       equ 0001h
LCDDATA0_SEG1_POSN                       equ 0001h
LCDDATA0_SEG1_POSITION                   equ 0001h
LCDDATA0_SEG1_SIZE                       equ 0001h
LCDDATA0_SEG1_LENGTH                     equ 0001h
LCDDATA0_SEG1_MASK                       equ 0002h
LCDDATA0_SEG2_POSN                       equ 0002h
LCDDATA0_SEG2_POSITION                   equ 0002h
LCDDATA0_SEG2_SIZE                       equ 0001h
LCDDATA0_SEG2_LENGTH                     equ 0001h
LCDDATA0_SEG2_MASK                       equ 0004h
LCDDATA0_SEG3_POSN                       equ 0003h
LCDDATA0_SEG3_POSITION                   equ 0003h
LCDDATA0_SEG3_SIZE                       equ 0001h
LCDDATA0_SEG3_LENGTH                     equ 0001h
LCDDATA0_SEG3_MASK                       equ 0008h
LCDDATA0_SEG4_POSN                       equ 0004h
LCDDATA0_SEG4_POSITION                   equ 0004h
LCDDATA0_SEG4_SIZE                       equ 0001h
LCDDATA0_SEG4_LENGTH                     equ 0001h
LCDDATA0_SEG4_MASK                       equ 0010h
LCDDATA0_SEG5_POSN                       equ 0005h
LCDDATA0_SEG5_POSITION                   equ 0005h
LCDDATA0_SEG5_SIZE                       equ 0001h
LCDDATA0_SEG5_LENGTH                     equ 0001h
LCDDATA0_SEG5_MASK                       equ 0020h
LCDDATA0_SEG6_POSN                       equ 0006h
LCDDATA0_SEG6_POSITION                   equ 0006h
LCDDATA0_SEG6_SIZE                       equ 0001h
LCDDATA0_SEG6_LENGTH                     equ 0001h
LCDDATA0_SEG6_MASK                       equ 0040h
LCDDATA0_SEG7_POSN                       equ 0007h
LCDDATA0_SEG7_POSITION                   equ 0007h
LCDDATA0_SEG7_SIZE                       equ 0001h
LCDDATA0_SEG7_LENGTH                     equ 0001h
LCDDATA0_SEG7_MASK                       equ 0080h
LCDDATA0_SEG0COM0_POSN                   equ 0000h
LCDDATA0_SEG0COM0_POSITION               equ 0000h
LCDDATA0_SEG0COM0_SIZE                   equ 0001h
LCDDATA0_SEG0COM0_LENGTH                 equ 0001h
LCDDATA0_SEG0COM0_MASK                   equ 0001h
LCDDATA0_SEG1COM0_POSN                   equ 0001h
LCDDATA0_SEG1COM0_POSITION               equ 0001h
LCDDATA0_SEG1COM0_SIZE                   equ 0001h
LCDDATA0_SEG1COM0_LENGTH                 equ 0001h
LCDDATA0_SEG1COM0_MASK                   equ 0002h
LCDDATA0_SEG2COM0_POSN                   equ 0002h
LCDDATA0_SEG2COM0_POSITION               equ 0002h
LCDDATA0_SEG2COM0_SIZE                   equ 0001h
LCDDATA0_SEG2COM0_LENGTH                 equ 0001h
LCDDATA0_SEG2COM0_MASK                   equ 0004h
LCDDATA0_SEG3COM0_POSN                   equ 0003h
LCDDATA0_SEG3COM0_POSITION               equ 0003h
LCDDATA0_SEG3COM0_SIZE                   equ 0001h
LCDDATA0_SEG3COM0_LENGTH                 equ 0001h
LCDDATA0_SEG3COM0_MASK                   equ 0008h
LCDDATA0_SEG4COM0_POSN                   equ 0004h
LCDDATA0_SEG4COM0_POSITION               equ 0004h
LCDDATA0_SEG4COM0_SIZE                   equ 0001h
LCDDATA0_SEG4COM0_LENGTH                 equ 0001h
LCDDATA0_SEG4COM0_MASK                   equ 0010h
LCDDATA0_SEG5COM0_POSN                   equ 0005h
LCDDATA0_SEG5COM0_POSITION               equ 0005h
LCDDATA0_SEG5COM0_SIZE                   equ 0001h
LCDDATA0_SEG5COM0_LENGTH                 equ 0001h
LCDDATA0_SEG5COM0_MASK                   equ 0020h
LCDDATA0_SEG6COM0_POSN                   equ 0006h
LCDDATA0_SEG6COM0_POSITION               equ 0006h
LCDDATA0_SEG6COM0_SIZE                   equ 0001h
LCDDATA0_SEG6COM0_LENGTH                 equ 0001h
LCDDATA0_SEG6COM0_MASK                   equ 0040h
LCDDATA0_SEG7COM0_POSN                   equ 0007h
LCDDATA0_SEG7COM0_POSITION               equ 0007h
LCDDATA0_SEG7COM0_SIZE                   equ 0001h
LCDDATA0_SEG7COM0_LENGTH                 equ 0001h
LCDDATA0_SEG7COM0_MASK                   equ 0080h
LCDDATA0_S0C0_POSN                       equ 0000h
LCDDATA0_S0C0_POSITION                   equ 0000h
LCDDATA0_S0C0_SIZE                       equ 0001h
LCDDATA0_S0C0_LENGTH                     equ 0001h
LCDDATA0_S0C0_MASK                       equ 0001h
LCDDATA0_S1C0_POSN                       equ 0001h
LCDDATA0_S1C0_POSITION                   equ 0001h
LCDDATA0_S1C0_SIZE                       equ 0001h
LCDDATA0_S1C0_LENGTH                     equ 0001h
LCDDATA0_S1C0_MASK                       equ 0002h
LCDDATA0_S2C0_POSN                       equ 0002h
LCDDATA0_S2C0_POSITION                   equ 0002h
LCDDATA0_S2C0_SIZE                       equ 0001h
LCDDATA0_S2C0_LENGTH                     equ 0001h
LCDDATA0_S2C0_MASK                       equ 0004h
LCDDATA0_S3C0_POSN                       equ 0003h
LCDDATA0_S3C0_POSITION                   equ 0003h
LCDDATA0_S3C0_SIZE                       equ 0001h
LCDDATA0_S3C0_LENGTH                     equ 0001h
LCDDATA0_S3C0_MASK                       equ 0008h
LCDDATA0_S4C0_POSN                       equ 0004h
LCDDATA0_S4C0_POSITION                   equ 0004h
LCDDATA0_S4C0_SIZE                       equ 0001h
LCDDATA0_S4C0_LENGTH                     equ 0001h
LCDDATA0_S4C0_MASK                       equ 0010h
LCDDATA0_S5C0_POSN                       equ 0005h
LCDDATA0_S5C0_POSITION                   equ 0005h
LCDDATA0_S5C0_SIZE                       equ 0001h
LCDDATA0_S5C0_LENGTH                     equ 0001h
LCDDATA0_S5C0_MASK                       equ 0020h
LCDDATA0_S6C0_POSN                       equ 0006h
LCDDATA0_S6C0_POSITION                   equ 0006h
LCDDATA0_S6C0_SIZE                       equ 0001h
LCDDATA0_S6C0_LENGTH                     equ 0001h
LCDDATA0_S6C0_MASK                       equ 0040h
LCDDATA0_S7C0_POSN                       equ 0007h
LCDDATA0_S7C0_POSITION                   equ 0007h
LCDDATA0_S7C0_SIZE                       equ 0001h
LCDDATA0_S7C0_LENGTH                     equ 0001h
LCDDATA0_S7C0_MASK                       equ 0080h

// Register: LCDDATA1
#define LCDDATA1 LCDDATA1
LCDDATA1                                 equ 0111h
// bitfield definitions
LCDDATA1_SEG8_POSN                       equ 0000h
LCDDATA1_SEG8_POSITION                   equ 0000h
LCDDATA1_SEG8_SIZE                       equ 0001h
LCDDATA1_SEG8_LENGTH                     equ 0001h
LCDDATA1_SEG8_MASK                       equ 0001h
LCDDATA1_SEG9_POSN                       equ 0001h
LCDDATA1_SEG9_POSITION                   equ 0001h
LCDDATA1_SEG9_SIZE                       equ 0001h
LCDDATA1_SEG9_LENGTH                     equ 0001h
LCDDATA1_SEG9_MASK                       equ 0002h
LCDDATA1_SEG10_POSN                      equ 0002h
LCDDATA1_SEG10_POSITION                  equ 0002h
LCDDATA1_SEG10_SIZE                      equ 0001h
LCDDATA1_SEG10_LENGTH                    equ 0001h
LCDDATA1_SEG10_MASK                      equ 0004h
LCDDATA1_SEG11_POSN                      equ 0003h
LCDDATA1_SEG11_POSITION                  equ 0003h
LCDDATA1_SEG11_SIZE                      equ 0001h
LCDDATA1_SEG11_LENGTH                    equ 0001h
LCDDATA1_SEG11_MASK                      equ 0008h
LCDDATA1_SEG12_POSN                      equ 0004h
LCDDATA1_SEG12_POSITION                  equ 0004h
LCDDATA1_SEG12_SIZE                      equ 0001h
LCDDATA1_SEG12_LENGTH                    equ 0001h
LCDDATA1_SEG12_MASK                      equ 0010h
LCDDATA1_SEG13_POSN                      equ 0005h
LCDDATA1_SEG13_POSITION                  equ 0005h
LCDDATA1_SEG13_SIZE                      equ 0001h
LCDDATA1_SEG13_LENGTH                    equ 0001h
LCDDATA1_SEG13_MASK                      equ 0020h
LCDDATA1_SEG14_POSN                      equ 0006h
LCDDATA1_SEG14_POSITION                  equ 0006h
LCDDATA1_SEG14_SIZE                      equ 0001h
LCDDATA1_SEG14_LENGTH                    equ 0001h
LCDDATA1_SEG14_MASK                      equ 0040h
LCDDATA1_SEG15_POSN                      equ 0007h
LCDDATA1_SEG15_POSITION                  equ 0007h
LCDDATA1_SEG15_SIZE                      equ 0001h
LCDDATA1_SEG15_LENGTH                    equ 0001h
LCDDATA1_SEG15_MASK                      equ 0080h
LCDDATA1_SEG8COM0_POSN                   equ 0000h
LCDDATA1_SEG8COM0_POSITION               equ 0000h
LCDDATA1_SEG8COM0_SIZE                   equ 0001h
LCDDATA1_SEG8COM0_LENGTH                 equ 0001h
LCDDATA1_SEG8COM0_MASK                   equ 0001h
LCDDATA1_SEG9COM0_POSN                   equ 0001h
LCDDATA1_SEG9COM0_POSITION               equ 0001h
LCDDATA1_SEG9COM0_SIZE                   equ 0001h
LCDDATA1_SEG9COM0_LENGTH                 equ 0001h
LCDDATA1_SEG9COM0_MASK                   equ 0002h
LCDDATA1_SEG10COM0_POSN                  equ 0002h
LCDDATA1_SEG10COM0_POSITION              equ 0002h
LCDDATA1_SEG10COM0_SIZE                  equ 0001h
LCDDATA1_SEG10COM0_LENGTH                equ 0001h
LCDDATA1_SEG10COM0_MASK                  equ 0004h
LCDDATA1_SEG11COM0_POSN                  equ 0003h
LCDDATA1_SEG11COM0_POSITION              equ 0003h
LCDDATA1_SEG11COM0_SIZE                  equ 0001h
LCDDATA1_SEG11COM0_LENGTH                equ 0001h
LCDDATA1_SEG11COM0_MASK                  equ 0008h
LCDDATA1_SEG12COM0_POSN                  equ 0004h
LCDDATA1_SEG12COM0_POSITION              equ 0004h
LCDDATA1_SEG12COM0_SIZE                  equ 0001h
LCDDATA1_SEG12COM0_LENGTH                equ 0001h
LCDDATA1_SEG12COM0_MASK                  equ 0010h
LCDDATA1_SEG13COM0_POSN                  equ 0005h
LCDDATA1_SEG13COM0_POSITION              equ 0005h
LCDDATA1_SEG13COM0_SIZE                  equ 0001h
LCDDATA1_SEG13COM0_LENGTH                equ 0001h
LCDDATA1_SEG13COM0_MASK                  equ 0020h
LCDDATA1_SEG14COM0_POSN                  equ 0006h
LCDDATA1_SEG14COM0_POSITION              equ 0006h
LCDDATA1_SEG14COM0_SIZE                  equ 0001h
LCDDATA1_SEG14COM0_LENGTH                equ 0001h
LCDDATA1_SEG14COM0_MASK                  equ 0040h
LCDDATA1_SEG15COM0_POSN                  equ 0007h
LCDDATA1_SEG15COM0_POSITION              equ 0007h
LCDDATA1_SEG15COM0_SIZE                  equ 0001h
LCDDATA1_SEG15COM0_LENGTH                equ 0001h
LCDDATA1_SEG15COM0_MASK                  equ 0080h
LCDDATA1_S8C0_POSN                       equ 0000h
LCDDATA1_S8C0_POSITION                   equ 0000h
LCDDATA1_S8C0_SIZE                       equ 0001h
LCDDATA1_S8C0_LENGTH                     equ 0001h
LCDDATA1_S8C0_MASK                       equ 0001h
LCDDATA1_S9C0_POSN                       equ 0001h
LCDDATA1_S9C0_POSITION                   equ 0001h
LCDDATA1_S9C0_SIZE                       equ 0001h
LCDDATA1_S9C0_LENGTH                     equ 0001h
LCDDATA1_S9C0_MASK                       equ 0002h
LCDDATA1_S10C0_POSN                      equ 0002h
LCDDATA1_S10C0_POSITION                  equ 0002h
LCDDATA1_S10C0_SIZE                      equ 0001h
LCDDATA1_S10C0_LENGTH                    equ 0001h
LCDDATA1_S10C0_MASK                      equ 0004h
LCDDATA1_S11C0_POSN                      equ 0003h
LCDDATA1_S11C0_POSITION                  equ 0003h
LCDDATA1_S11C0_SIZE                      equ 0001h
LCDDATA1_S11C0_LENGTH                    equ 0001h
LCDDATA1_S11C0_MASK                      equ 0008h
LCDDATA1_S12C0_POSN                      equ 0004h
LCDDATA1_S12C0_POSITION                  equ 0004h
LCDDATA1_S12C0_SIZE                      equ 0001h
LCDDATA1_S12C0_LENGTH                    equ 0001h
LCDDATA1_S12C0_MASK                      equ 0010h
LCDDATA1_S13C0_POSN                      equ 0005h
LCDDATA1_S13C0_POSITION                  equ 0005h
LCDDATA1_S13C0_SIZE                      equ 0001h
LCDDATA1_S13C0_LENGTH                    equ 0001h
LCDDATA1_S13C0_MASK                      equ 0020h
LCDDATA1_S14C0_POSN                      equ 0006h
LCDDATA1_S14C0_POSITION                  equ 0006h
LCDDATA1_S14C0_SIZE                      equ 0001h
LCDDATA1_S14C0_LENGTH                    equ 0001h
LCDDATA1_S14C0_MASK                      equ 0040h
LCDDATA1_S15C0_POSN                      equ 0007h
LCDDATA1_S15C0_POSITION                  equ 0007h
LCDDATA1_S15C0_SIZE                      equ 0001h
LCDDATA1_S15C0_LENGTH                    equ 0001h
LCDDATA1_S15C0_MASK                      equ 0080h

