GopalSaraf/Practicals/PSDL/include/proc/pic16f916.inc
// Register: LCDDATA3
#define LCDDATA3 LCDDATA3
LCDDATA3                                 equ 0113h
// bitfield definitions
LCDDATA3_SEG0_POSN                       equ 0000h
LCDDATA3_SEG0_POSITION                   equ 0000h
LCDDATA3_SEG0_SIZE                       equ 0001h
LCDDATA3_SEG0_LENGTH                     equ 0001h
LCDDATA3_SEG0_MASK                       equ 0001h
LCDDATA3_SEG1_POSN                       equ 0001h
LCDDATA3_SEG1_POSITION                   equ 0001h
LCDDATA3_SEG1_SIZE                       equ 0001h
LCDDATA3_SEG1_LENGTH                     equ 0001h
LCDDATA3_SEG1_MASK                       equ 0002h
LCDDATA3_SEG2_POSN                       equ 0002h
LCDDATA3_SEG2_POSITION                   equ 0002h
LCDDATA3_SEG2_SIZE                       equ 0001h
LCDDATA3_SEG2_LENGTH                     equ 0001h
LCDDATA3_SEG2_MASK                       equ 0004h
LCDDATA3_SEG3_POSN                       equ 0003h
LCDDATA3_SEG3_POSITION                   equ 0003h
LCDDATA3_SEG3_SIZE                       equ 0001h
LCDDATA3_SEG3_LENGTH                     equ 0001h
LCDDATA3_SEG3_MASK                       equ 0008h
LCDDATA3_SEG4_POSN                       equ 0004h
LCDDATA3_SEG4_POSITION                   equ 0004h
LCDDATA3_SEG4_SIZE                       equ 0001h
LCDDATA3_SEG4_LENGTH                     equ 0001h
LCDDATA3_SEG4_MASK                       equ 0010h
LCDDATA3_SEG5_POSN                       equ 0005h
LCDDATA3_SEG5_POSITION                   equ 0005h
LCDDATA3_SEG5_SIZE                       equ 0001h
LCDDATA3_SEG5_LENGTH                     equ 0001h
LCDDATA3_SEG5_MASK                       equ 0020h
LCDDATA3_SEG6_POSN                       equ 0006h
LCDDATA3_SEG6_POSITION                   equ 0006h
LCDDATA3_SEG6_SIZE                       equ 0001h
LCDDATA3_SEG6_LENGTH                     equ 0001h
LCDDATA3_SEG6_MASK                       equ 0040h
LCDDATA3_SEG7_POSN                       equ 0007h
LCDDATA3_SEG7_POSITION                   equ 0007h
LCDDATA3_SEG7_SIZE                       equ 0001h
LCDDATA3_SEG7_LENGTH                     equ 0001h
LCDDATA3_SEG7_MASK                       equ 0080h
LCDDATA3_SEG0COM1_POSN                   equ 0000h
LCDDATA3_SEG0COM1_POSITION               equ 0000h
LCDDATA3_SEG0COM1_SIZE                   equ 0001h
LCDDATA3_SEG0COM1_LENGTH                 equ 0001h
LCDDATA3_SEG0COM1_MASK                   equ 0001h
LCDDATA3_SEG1COM1_POSN                   equ 0001h
LCDDATA3_SEG1COM1_POSITION               equ 0001h
LCDDATA3_SEG1COM1_SIZE                   equ 0001h
LCDDATA3_SEG1COM1_LENGTH                 equ 0001h
LCDDATA3_SEG1COM1_MASK                   equ 0002h
LCDDATA3_SEG2COM1_POSN                   equ 0002h
LCDDATA3_SEG2COM1_POSITION               equ 0002h
LCDDATA3_SEG2COM1_SIZE                   equ 0001h
LCDDATA3_SEG2COM1_LENGTH                 equ 0001h
LCDDATA3_SEG2COM1_MASK                   equ 0004h
LCDDATA3_SEG3COM1_POSN                   equ 0003h
LCDDATA3_SEG3COM1_POSITION               equ 0003h
LCDDATA3_SEG3COM1_SIZE                   equ 0001h
LCDDATA3_SEG3COM1_LENGTH                 equ 0001h
LCDDATA3_SEG3COM1_MASK                   equ 0008h
LCDDATA3_SEG4COM1_POSN                   equ 0004h
LCDDATA3_SEG4COM1_POSITION               equ 0004h
LCDDATA3_SEG4COM1_SIZE                   equ 0001h
LCDDATA3_SEG4COM1_LENGTH                 equ 0001h
LCDDATA3_SEG4COM1_MASK                   equ 0010h
LCDDATA3_SEG5COM1_POSN                   equ 0005h
LCDDATA3_SEG5COM1_POSITION               equ 0005h
LCDDATA3_SEG5COM1_SIZE                   equ 0001h
LCDDATA3_SEG5COM1_LENGTH                 equ 0001h
LCDDATA3_SEG5COM1_MASK                   equ 0020h
LCDDATA3_SEG6COM1_POSN                   equ 0006h
LCDDATA3_SEG6COM1_POSITION               equ 0006h
LCDDATA3_SEG6COM1_SIZE                   equ 0001h
LCDDATA3_SEG6COM1_LENGTH                 equ 0001h
LCDDATA3_SEG6COM1_MASK                   equ 0040h
LCDDATA3_SEG7COM1_POSN                   equ 0007h
LCDDATA3_SEG7COM1_POSITION               equ 0007h
LCDDATA3_SEG7COM1_SIZE                   equ 0001h
LCDDATA3_SEG7COM1_LENGTH                 equ 0001h
LCDDATA3_SEG7COM1_MASK                   equ 0080h
LCDDATA3_S0C1_POSN                       equ 0000h
LCDDATA3_S0C1_POSITION                   equ 0000h
LCDDATA3_S0C1_SIZE                       equ 0001h
LCDDATA3_S0C1_LENGTH                     equ 0001h
LCDDATA3_S0C1_MASK                       equ 0001h
LCDDATA3_S1C1_POSN                       equ 0001h
LCDDATA3_S1C1_POSITION                   equ 0001h
LCDDATA3_S1C1_SIZE                       equ 0001h
LCDDATA3_S1C1_LENGTH                     equ 0001h
LCDDATA3_S1C1_MASK                       equ 0002h
LCDDATA3_S2C1_POSN                       equ 0002h
LCDDATA3_S2C1_POSITION                   equ 0002h
LCDDATA3_S2C1_SIZE                       equ 0001h
LCDDATA3_S2C1_LENGTH                     equ 0001h
LCDDATA3_S2C1_MASK                       equ 0004h
LCDDATA3_S3C1_POSN                       equ 0003h
LCDDATA3_S3C1_POSITION                   equ 0003h
LCDDATA3_S3C1_SIZE                       equ 0001h
LCDDATA3_S3C1_LENGTH                     equ 0001h
LCDDATA3_S3C1_MASK                       equ 0008h
LCDDATA3_S4C1_POSN                       equ 0004h
LCDDATA3_S4C1_POSITION                   equ 0004h
LCDDATA3_S4C1_SIZE                       equ 0001h
LCDDATA3_S4C1_LENGTH                     equ 0001h
LCDDATA3_S4C1_MASK                       equ 0010h
LCDDATA3_S5C1_POSN                       equ 0005h
LCDDATA3_S5C1_POSITION                   equ 0005h
LCDDATA3_S5C1_SIZE                       equ 0001h
LCDDATA3_S5C1_LENGTH                     equ 0001h
LCDDATA3_S5C1_MASK                       equ 0020h
LCDDATA3_S6C1_POSN                       equ 0006h
LCDDATA3_S6C1_POSITION                   equ 0006h
LCDDATA3_S6C1_SIZE                       equ 0001h
LCDDATA3_S6C1_LENGTH                     equ 0001h
LCDDATA3_S6C1_MASK                       equ 0040h
LCDDATA3_S7C1_POSN                       equ 0007h
LCDDATA3_S7C1_POSITION                   equ 0007h
LCDDATA3_S7C1_SIZE                       equ 0001h
LCDDATA3_S7C1_LENGTH                     equ 0001h
LCDDATA3_S7C1_MASK                       equ 0080h

