GopalSaraf/Practicals/PSDL/include/proc/pic16f916.inc
// Register: LCDDATA6
#define LCDDATA6 LCDDATA6
LCDDATA6                                 equ 0116h
// bitfield definitions
LCDDATA6_SEG0_POSN                       equ 0000h
LCDDATA6_SEG0_POSITION                   equ 0000h
LCDDATA6_SEG0_SIZE                       equ 0001h
LCDDATA6_SEG0_LENGTH                     equ 0001h
LCDDATA6_SEG0_MASK                       equ 0001h
LCDDATA6_SEG1_POSN                       equ 0001h
LCDDATA6_SEG1_POSITION                   equ 0001h
LCDDATA6_SEG1_SIZE                       equ 0001h
LCDDATA6_SEG1_LENGTH                     equ 0001h
LCDDATA6_SEG1_MASK                       equ 0002h
LCDDATA6_SEG2_POSN                       equ 0002h
LCDDATA6_SEG2_POSITION                   equ 0002h
LCDDATA6_SEG2_SIZE                       equ 0001h
LCDDATA6_SEG2_LENGTH                     equ 0001h
LCDDATA6_SEG2_MASK                       equ 0004h
LCDDATA6_SEG3_POSN                       equ 0003h
LCDDATA6_SEG3_POSITION                   equ 0003h
LCDDATA6_SEG3_SIZE                       equ 0001h
LCDDATA6_SEG3_LENGTH                     equ 0001h
LCDDATA6_SEG3_MASK                       equ 0008h
LCDDATA6_SEG4_POSN                       equ 0004h
LCDDATA6_SEG4_POSITION                   equ 0004h
LCDDATA6_SEG4_SIZE                       equ 0001h
LCDDATA6_SEG4_LENGTH                     equ 0001h
LCDDATA6_SEG4_MASK                       equ 0010h
LCDDATA6_SEG5_POSN                       equ 0005h
LCDDATA6_SEG5_POSITION                   equ 0005h
LCDDATA6_SEG5_SIZE                       equ 0001h
LCDDATA6_SEG5_LENGTH                     equ 0001h
LCDDATA6_SEG5_MASK                       equ 0020h
LCDDATA6_SEG6_POSN                       equ 0006h
LCDDATA6_SEG6_POSITION                   equ 0006h
LCDDATA6_SEG6_SIZE                       equ 0001h
LCDDATA6_SEG6_LENGTH                     equ 0001h
LCDDATA6_SEG6_MASK                       equ 0040h
LCDDATA6_SEG7_POSN                       equ 0007h
LCDDATA6_SEG7_POSITION                   equ 0007h
LCDDATA6_SEG7_SIZE                       equ 0001h
LCDDATA6_SEG7_LENGTH                     equ 0001h
LCDDATA6_SEG7_MASK                       equ 0080h
LCDDATA6_SEG0COM2_POSN                   equ 0000h
LCDDATA6_SEG0COM2_POSITION               equ 0000h
LCDDATA6_SEG0COM2_SIZE                   equ 0001h
LCDDATA6_SEG0COM2_LENGTH                 equ 0001h
LCDDATA6_SEG0COM2_MASK                   equ 0001h
LCDDATA6_SEG1COM2_POSN                   equ 0001h
LCDDATA6_SEG1COM2_POSITION               equ 0001h
LCDDATA6_SEG1COM2_SIZE                   equ 0001h
LCDDATA6_SEG1COM2_LENGTH                 equ 0001h
LCDDATA6_SEG1COM2_MASK                   equ 0002h
LCDDATA6_SEG2COM2_POSN                   equ 0002h
LCDDATA6_SEG2COM2_POSITION               equ 0002h
LCDDATA6_SEG2COM2_SIZE                   equ 0001h
LCDDATA6_SEG2COM2_LENGTH                 equ 0001h
LCDDATA6_SEG2COM2_MASK                   equ 0004h
LCDDATA6_SEG3COM2_POSN                   equ 0003h
LCDDATA6_SEG3COM2_POSITION               equ 0003h
LCDDATA6_SEG3COM2_SIZE                   equ 0001h
LCDDATA6_SEG3COM2_LENGTH                 equ 0001h
LCDDATA6_SEG3COM2_MASK                   equ 0008h
LCDDATA6_SEG4COM2_POSN                   equ 0004h
LCDDATA6_SEG4COM2_POSITION               equ 0004h
LCDDATA6_SEG4COM2_SIZE                   equ 0001h
LCDDATA6_SEG4COM2_LENGTH                 equ 0001h
LCDDATA6_SEG4COM2_MASK                   equ 0010h
LCDDATA6_SEG5COM2_POSN                   equ 0005h
LCDDATA6_SEG5COM2_POSITION               equ 0005h
LCDDATA6_SEG5COM2_SIZE                   equ 0001h
LCDDATA6_SEG5COM2_LENGTH                 equ 0001h
LCDDATA6_SEG5COM2_MASK                   equ 0020h
LCDDATA6_SEG6COM2_POSN                   equ 0006h
LCDDATA6_SEG6COM2_POSITION               equ 0006h
LCDDATA6_SEG6COM2_SIZE                   equ 0001h
LCDDATA6_SEG6COM2_LENGTH                 equ 0001h
LCDDATA6_SEG6COM2_MASK                   equ 0040h
LCDDATA6_SEG7COM2_POSN                   equ 0007h
LCDDATA6_SEG7COM2_POSITION               equ 0007h
LCDDATA6_SEG7COM2_SIZE                   equ 0001h
LCDDATA6_SEG7COM2_LENGTH                 equ 0001h
LCDDATA6_SEG7COM2_MASK                   equ 0080h
LCDDATA6_S0C2_POSN                       equ 0000h
LCDDATA6_S0C2_POSITION                   equ 0000h
LCDDATA6_S0C2_SIZE                       equ 0001h
LCDDATA6_S0C2_LENGTH                     equ 0001h
LCDDATA6_S0C2_MASK                       equ 0001h
LCDDATA6_S1C2_POSN                       equ 0001h
LCDDATA6_S1C2_POSITION                   equ 0001h
LCDDATA6_S1C2_SIZE                       equ 0001h
LCDDATA6_S1C2_LENGTH                     equ 0001h
LCDDATA6_S1C2_MASK                       equ 0002h
LCDDATA6_S2C2_POSN                       equ 0002h
LCDDATA6_S2C2_POSITION                   equ 0002h
LCDDATA6_S2C2_SIZE                       equ 0001h
LCDDATA6_S2C2_LENGTH                     equ 0001h
LCDDATA6_S2C2_MASK                       equ 0004h
LCDDATA6_S3C2_POSN                       equ 0003h
LCDDATA6_S3C2_POSITION                   equ 0003h
LCDDATA6_S3C2_SIZE                       equ 0001h
LCDDATA6_S3C2_LENGTH                     equ 0001h
LCDDATA6_S3C2_MASK                       equ 0008h
LCDDATA6_S4C2_POSN                       equ 0004h
LCDDATA6_S4C2_POSITION                   equ 0004h
LCDDATA6_S4C2_SIZE                       equ 0001h
LCDDATA6_S4C2_LENGTH                     equ 0001h
LCDDATA6_S4C2_MASK                       equ 0010h
LCDDATA6_S5C2_POSN                       equ 0005h
LCDDATA6_S5C2_POSITION                   equ 0005h
LCDDATA6_S5C2_SIZE                       equ 0001h
LCDDATA6_S5C2_LENGTH                     equ 0001h
LCDDATA6_S5C2_MASK                       equ 0020h
LCDDATA6_S6C2_POSN                       equ 0006h
LCDDATA6_S6C2_POSITION                   equ 0006h
LCDDATA6_S6C2_SIZE                       equ 0001h
LCDDATA6_S6C2_LENGTH                     equ 0001h
LCDDATA6_S6C2_MASK                       equ 0040h
LCDDATA6_S7C2_POSN                       equ 0007h
LCDDATA6_S7C2_POSITION                   equ 0007h
LCDDATA6_S7C2_SIZE                       equ 0001h
LCDDATA6_S7C2_LENGTH                     equ 0001h
LCDDATA6_S7C2_MASK                       equ 0080h

// Register: LCDDATA7
#define LCDDATA7 LCDDATA7
LCDDATA7                                 equ 0117h
// bitfield definitions
LCDDATA7_SEG8_POSN                       equ 0000h
LCDDATA7_SEG8_POSITION                   equ 0000h
LCDDATA7_SEG8_SIZE                       equ 0001h
LCDDATA7_SEG8_LENGTH                     equ 0001h
LCDDATA7_SEG8_MASK                       equ 0001h
LCDDATA7_SEG9_POSN                       equ 0001h
LCDDATA7_SEG9_POSITION                   equ 0001h
LCDDATA7_SEG9_SIZE                       equ 0001h
LCDDATA7_SEG9_LENGTH                     equ 0001h
LCDDATA7_SEG9_MASK                       equ 0002h
LCDDATA7_SEG10_POSN                      equ 0002h
LCDDATA7_SEG10_POSITION                  equ 0002h
LCDDATA7_SEG10_SIZE                      equ 0001h
LCDDATA7_SEG10_LENGTH                    equ 0001h
LCDDATA7_SEG10_MASK                      equ 0004h
LCDDATA7_SEG11_POSN                      equ 0003h
LCDDATA7_SEG11_POSITION                  equ 0003h
LCDDATA7_SEG11_SIZE                      equ 0001h
LCDDATA7_SEG11_LENGTH                    equ 0001h
LCDDATA7_SEG11_MASK                      equ 0008h
LCDDATA7_SEG12_POSN                      equ 0004h
LCDDATA7_SEG12_POSITION                  equ 0004h
LCDDATA7_SEG12_SIZE                      equ 0001h
LCDDATA7_SEG12_LENGTH                    equ 0001h
LCDDATA7_SEG12_MASK                      equ 0010h
LCDDATA7_SEG13_POSN                      equ 0005h
LCDDATA7_SEG13_POSITION                  equ 0005h
LCDDATA7_SEG13_SIZE                      equ 0001h
LCDDATA7_SEG13_LENGTH                    equ 0001h
LCDDATA7_SEG13_MASK                      equ 0020h
LCDDATA7_SEG14_POSN                      equ 0006h
LCDDATA7_SEG14_POSITION                  equ 0006h
LCDDATA7_SEG14_SIZE                      equ 0001h
LCDDATA7_SEG14_LENGTH                    equ 0001h
LCDDATA7_SEG14_MASK                      equ 0040h
LCDDATA7_SEG15_POSN                      equ 0007h
LCDDATA7_SEG15_POSITION                  equ 0007h
LCDDATA7_SEG15_SIZE                      equ 0001h
LCDDATA7_SEG15_LENGTH                    equ 0001h
LCDDATA7_SEG15_MASK                      equ 0080h
LCDDATA7_SEG8COM2_POSN                   equ 0000h
LCDDATA7_SEG8COM2_POSITION               equ 0000h
LCDDATA7_SEG8COM2_SIZE                   equ 0001h
LCDDATA7_SEG8COM2_LENGTH                 equ 0001h
LCDDATA7_SEG8COM2_MASK                   equ 0001h
LCDDATA7_SEG9COM2_POSN                   equ 0001h
LCDDATA7_SEG9COM2_POSITION               equ 0001h
LCDDATA7_SEG9COM2_SIZE                   equ 0001h
LCDDATA7_SEG9COM2_LENGTH                 equ 0001h
LCDDATA7_SEG9COM2_MASK                   equ 0002h
LCDDATA7_SEG10COM2_POSN                  equ 0002h
LCDDATA7_SEG10COM2_POSITION              equ 0002h
LCDDATA7_SEG10COM2_SIZE                  equ 0001h
LCDDATA7_SEG10COM2_LENGTH                equ 0001h
LCDDATA7_SEG10COM2_MASK                  equ 0004h
LCDDATA7_SEG11COM2_POSN                  equ 0003h
LCDDATA7_SEG11COM2_POSITION              equ 0003h
LCDDATA7_SEG11COM2_SIZE                  equ 0001h
LCDDATA7_SEG11COM2_LENGTH                equ 0001h
LCDDATA7_SEG11COM2_MASK                  equ 0008h
LCDDATA7_SEG12COM2_POSN                  equ 0004h
LCDDATA7_SEG12COM2_POSITION              equ 0004h
LCDDATA7_SEG12COM2_SIZE                  equ 0001h
LCDDATA7_SEG12COM2_LENGTH                equ 0001h
LCDDATA7_SEG12COM2_MASK                  equ 0010h
LCDDATA7_SEG13COM2_POSN                  equ 0005h
LCDDATA7_SEG13COM2_POSITION              equ 0005h
LCDDATA7_SEG13COM2_SIZE                  equ 0001h
LCDDATA7_SEG13COM2_LENGTH                equ 0001h
LCDDATA7_SEG13COM2_MASK                  equ 0020h
LCDDATA7_SEG14COM2_POSN                  equ 0006h
LCDDATA7_SEG14COM2_POSITION              equ 0006h
LCDDATA7_SEG14COM2_SIZE                  equ 0001h
LCDDATA7_SEG14COM2_LENGTH                equ 0001h
LCDDATA7_SEG14COM2_MASK                  equ 0040h
LCDDATA7_SEG15COM2_POSN                  equ 0007h
LCDDATA7_SEG15COM2_POSITION              equ 0007h
LCDDATA7_SEG15COM2_SIZE                  equ 0001h
LCDDATA7_SEG15COM2_LENGTH                equ 0001h
LCDDATA7_SEG15COM2_MASK                  equ 0080h
LCDDATA7_S8C2_POSN                       equ 0000h
LCDDATA7_S8C2_POSITION                   equ 0000h
LCDDATA7_S8C2_SIZE                       equ 0001h
LCDDATA7_S8C2_LENGTH                     equ 0001h
LCDDATA7_S8C2_MASK                       equ 0001h
LCDDATA7_S9C2_POSN                       equ 0001h
LCDDATA7_S9C2_POSITION                   equ 0001h
LCDDATA7_S9C2_SIZE                       equ 0001h
LCDDATA7_S9C2_LENGTH                     equ 0001h
LCDDATA7_S9C2_MASK                       equ 0002h
LCDDATA7_S10C2_POSN                      equ 0002h
LCDDATA7_S10C2_POSITION                  equ 0002h
LCDDATA7_S10C2_SIZE                      equ 0001h
LCDDATA7_S10C2_LENGTH                    equ 0001h
LCDDATA7_S10C2_MASK                      equ 0004h
LCDDATA7_S11C2_POSN                      equ 0003h
LCDDATA7_S11C2_POSITION                  equ 0003h
LCDDATA7_S11C2_SIZE                      equ 0001h
LCDDATA7_S11C2_LENGTH                    equ 0001h
LCDDATA7_S11C2_MASK                      equ 0008h
LCDDATA7_S12C2_POSN                      equ 0004h
LCDDATA7_S12C2_POSITION                  equ 0004h
LCDDATA7_S12C2_SIZE                      equ 0001h
LCDDATA7_S12C2_LENGTH                    equ 0001h
LCDDATA7_S12C2_MASK                      equ 0010h
LCDDATA7_S13C2_POSN                      equ 0005h
LCDDATA7_S13C2_POSITION                  equ 0005h
LCDDATA7_S13C2_SIZE                      equ 0001h
LCDDATA7_S13C2_LENGTH                    equ 0001h
LCDDATA7_S13C2_MASK                      equ 0020h
LCDDATA7_S14C2_POSN                      equ 0006h
LCDDATA7_S14C2_POSITION                  equ 0006h
LCDDATA7_S14C2_SIZE                      equ 0001h
LCDDATA7_S14C2_LENGTH                    equ 0001h
LCDDATA7_S14C2_MASK                      equ 0040h
LCDDATA7_S15C2_POSN                      equ 0007h
LCDDATA7_S15C2_POSITION                  equ 0007h
LCDDATA7_S15C2_SIZE                      equ 0001h
LCDDATA7_S15C2_LENGTH                    equ 0001h
LCDDATA7_S15C2_MASK                      equ 0080h

// Register: LCDDATA9
#define LCDDATA9 LCDDATA9
LCDDATA9                                 equ 0119h
// bitfield definitions
LCDDATA9_SEG0_POSN                       equ 0000h
LCDDATA9_SEG0_POSITION                   equ 0000h
LCDDATA9_SEG0_SIZE                       equ 0001h
LCDDATA9_SEG0_LENGTH                     equ 0001h
LCDDATA9_SEG0_MASK                       equ 0001h
LCDDATA9_SEG1_POSN                       equ 0001h
LCDDATA9_SEG1_POSITION                   equ 0001h
LCDDATA9_SEG1_SIZE                       equ 0001h
LCDDATA9_SEG1_LENGTH                     equ 0001h
LCDDATA9_SEG1_MASK                       equ 0002h
LCDDATA9_SEG2_POSN                       equ 0002h
LCDDATA9_SEG2_POSITION                   equ 0002h
LCDDATA9_SEG2_SIZE                       equ 0001h
LCDDATA9_SEG2_LENGTH                     equ 0001h
LCDDATA9_SEG2_MASK                       equ 0004h
LCDDATA9_SEG3_POSN                       equ 0003h
LCDDATA9_SEG3_POSITION                   equ 0003h
LCDDATA9_SEG3_SIZE                       equ 0001h
LCDDATA9_SEG3_LENGTH                     equ 0001h
LCDDATA9_SEG3_MASK                       equ 0008h
LCDDATA9_SEG4_POSN                       equ 0004h
LCDDATA9_SEG4_POSITION                   equ 0004h
LCDDATA9_SEG4_SIZE                       equ 0001h
LCDDATA9_SEG4_LENGTH                     equ 0001h
LCDDATA9_SEG4_MASK                       equ 0010h
LCDDATA9_SEG5_POSN                       equ 0005h
LCDDATA9_SEG5_POSITION                   equ 0005h
LCDDATA9_SEG5_SIZE                       equ 0001h
LCDDATA9_SEG5_LENGTH                     equ 0001h
LCDDATA9_SEG5_MASK                       equ 0020h
LCDDATA9_SEG6_POSN                       equ 0006h
LCDDATA9_SEG6_POSITION                   equ 0006h
LCDDATA9_SEG6_SIZE                       equ 0001h
LCDDATA9_SEG6_LENGTH                     equ 0001h
LCDDATA9_SEG6_MASK                       equ 0040h
LCDDATA9_SEG7_POSN                       equ 0007h
LCDDATA9_SEG7_POSITION                   equ 0007h
LCDDATA9_SEG7_SIZE                       equ 0001h
LCDDATA9_SEG7_LENGTH                     equ 0001h
LCDDATA9_SEG7_MASK                       equ 0080h
LCDDATA9_SEG0COM3_POSN                   equ 0000h
LCDDATA9_SEG0COM3_POSITION               equ 0000h
LCDDATA9_SEG0COM3_SIZE                   equ 0001h
LCDDATA9_SEG0COM3_LENGTH                 equ 0001h
LCDDATA9_SEG0COM3_MASK                   equ 0001h
LCDDATA9_SEG1COM3_POSN                   equ 0001h
LCDDATA9_SEG1COM3_POSITION               equ 0001h
LCDDATA9_SEG1COM3_SIZE                   equ 0001h
LCDDATA9_SEG1COM3_LENGTH                 equ 0001h
LCDDATA9_SEG1COM3_MASK                   equ 0002h
LCDDATA9_SEG2COM3_POSN                   equ 0002h
LCDDATA9_SEG2COM3_POSITION               equ 0002h
LCDDATA9_SEG2COM3_SIZE                   equ 0001h
LCDDATA9_SEG2COM3_LENGTH                 equ 0001h
LCDDATA9_SEG2COM3_MASK                   equ 0004h
LCDDATA9_SEG3COM3_POSN                   equ 0003h
LCDDATA9_SEG3COM3_POSITION               equ 0003h
LCDDATA9_SEG3COM3_SIZE                   equ 0001h
LCDDATA9_SEG3COM3_LENGTH                 equ 0001h
LCDDATA9_SEG3COM3_MASK                   equ 0008h
LCDDATA9_SEG4COM3_POSN                   equ 0004h
LCDDATA9_SEG4COM3_POSITION               equ 0004h
LCDDATA9_SEG4COM3_SIZE                   equ 0001h
LCDDATA9_SEG4COM3_LENGTH                 equ 0001h
LCDDATA9_SEG4COM3_MASK                   equ 0010h
LCDDATA9_SEG5COM3_POSN                   equ 0005h
LCDDATA9_SEG5COM3_POSITION               equ 0005h
LCDDATA9_SEG5COM3_SIZE                   equ 0001h
LCDDATA9_SEG5COM3_LENGTH                 equ 0001h
LCDDATA9_SEG5COM3_MASK                   equ 0020h
LCDDATA9_SEG6COM3_POSN                   equ 0006h
LCDDATA9_SEG6COM3_POSITION               equ 0006h
LCDDATA9_SEG6COM3_SIZE                   equ 0001h
LCDDATA9_SEG6COM3_LENGTH                 equ 0001h
LCDDATA9_SEG6COM3_MASK                   equ 0040h
LCDDATA9_SEG7COM3_POSN                   equ 0007h
LCDDATA9_SEG7COM3_POSITION               equ 0007h
LCDDATA9_SEG7COM3_SIZE                   equ 0001h
LCDDATA9_SEG7COM3_LENGTH                 equ 0001h
LCDDATA9_SEG7COM3_MASK                   equ 0080h
LCDDATA9_S0C3_POSN                       equ 0000h
LCDDATA9_S0C3_POSITION                   equ 0000h
LCDDATA9_S0C3_SIZE                       equ 0001h
LCDDATA9_S0C3_LENGTH                     equ 0001h
LCDDATA9_S0C3_MASK                       equ 0001h
LCDDATA9_S1C3_POSN                       equ 0001h
LCDDATA9_S1C3_POSITION                   equ 0001h
LCDDATA9_S1C3_SIZE                       equ 0001h
LCDDATA9_S1C3_LENGTH                     equ 0001h
LCDDATA9_S1C3_MASK                       equ 0002h
LCDDATA9_S2C3_POSN                       equ 0002h
LCDDATA9_S2C3_POSITION                   equ 0002h
LCDDATA9_S2C3_SIZE                       equ 0001h
LCDDATA9_S2C3_LENGTH                     equ 0001h
LCDDATA9_S2C3_MASK                       equ 0004h
LCDDATA9_S3C3_POSN                       equ 0003h
LCDDATA9_S3C3_POSITION                   equ 0003h
LCDDATA9_S3C3_SIZE                       equ 0001h
LCDDATA9_S3C3_LENGTH                     equ 0001h
LCDDATA9_S3C3_MASK                       equ 0008h
LCDDATA9_S4C3_POSN                       equ 0004h
LCDDATA9_S4C3_POSITION                   equ 0004h
LCDDATA9_S4C3_SIZE                       equ 0001h
LCDDATA9_S4C3_LENGTH                     equ 0001h
LCDDATA9_S4C3_MASK                       equ 0010h
LCDDATA9_S5C3_POSN                       equ 0005h
LCDDATA9_S5C3_POSITION                   equ 0005h
LCDDATA9_S5C3_SIZE                       equ 0001h
LCDDATA9_S5C3_LENGTH                     equ 0001h
LCDDATA9_S5C3_MASK                       equ 0020h
LCDDATA9_S6C3_POSN                       equ 0006h
LCDDATA9_S6C3_POSITION                   equ 0006h
LCDDATA9_S6C3_SIZE                       equ 0001h
LCDDATA9_S6C3_LENGTH                     equ 0001h
LCDDATA9_S6C3_MASK                       equ 0040h
LCDDATA9_S7C3_POSN                       equ 0007h
LCDDATA9_S7C3_POSITION                   equ 0007h
LCDDATA9_S7C3_SIZE                       equ 0001h
LCDDATA9_S7C3_LENGTH                     equ 0001h
LCDDATA9_S7C3_MASK                       equ 0080h

