GopalSaraf/Practicals/PSDL/include/proc/pic16f916.inc
/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ADCS0                            BANKMASK(ADCON1), 4
#define ADCS1                            BANKMASK(ADCON1), 5
#define ADCS2                            BANKMASK(ADCON1), 6
#define ADDEN                            BANKMASK(RCSTA), 3
#define ADFM                             BANKMASK(ADCON0), 7
#define ADIE                             BANKMASK(PIE1), 6
#define ADIF                             BANKMASK(PIR1), 6
#define ADON                             BANKMASK(ADCON0), 0
#define AN0                              BANKMASK(ANSEL), 0
#define AN1                              BANKMASK(ANSEL), 1
#define AN2                              BANKMASK(ANSEL), 2
#define AN3                              BANKMASK(ANSEL), 3
#define AN4                              BANKMASK(ANSEL), 4
#define ANS0                             BANKMASK(ANSEL), 0
#define ANS1                             BANKMASK(ANSEL), 1
#define ANS2                             BANKMASK(ANSEL), 2
#define ANS3                             BANKMASK(ANSEL), 3
#define ANS4                             BANKMASK(ANSEL), 4
#define BF                               BANKMASK(SSPSTAT), 0
#define BIASMD                           BANKMASK(LCDPS), 6
#define BRGH                             BANKMASK(TXSTA), 2
#define C1IE                             BANKMASK(PIE2), 5
#define C1IF                             BANKMASK(PIR2), 5
#define C1INV                            BANKMASK(CMCON0), 4
#define C1OUT                            BANKMASK(CMCON0), 6
#define C2IE                             BANKMASK(PIE2), 6
#define C2IF                             BANKMASK(PIR2), 6
#define C2INV                            BANKMASK(CMCON0), 5
#define C2OUT                            BANKMASK(CMCON0), 7
#define C2SYNC                           BANKMASK(CMCON1), 0
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1IE                           BANKMASK(PIE1), 2
#define CCP1IF                           BANKMASK(PIR1), 2
#define CCP1M0                           BANKMASK(CCP1CON), 0
#define CCP1M1                           BANKMASK(CCP1CON), 1
#define CCP1M2                           BANKMASK(CCP1CON), 2
#define CCP1M3                           BANKMASK(CCP1CON), 3
#define CCP1X                            BANKMASK(CCP1CON), 5
#define CCP1Y                            BANKMASK(CCP1CON), 4
#define CHS0                             BANKMASK(ADCON0), 2
#define CHS1                             BANKMASK(ADCON0), 3
#define CHS2                             BANKMASK(ADCON0), 4
#define CIS                              BANKMASK(CMCON0), 3
#define CKE                              BANKMASK(SSPSTAT), 6
#define CKP                              BANKMASK(SSPCON), 4
#define CM0                              BANKMASK(CMCON0), 0
#define CM1                              BANKMASK(CMCON0), 1
#define CM2                              BANKMASK(CMCON0), 2
#define CREN                             BANKMASK(RCSTA), 4
#define CS0                              BANKMASK(LCDCON), 2
#define CS1                              BANKMASK(LCDCON), 3
#define CSRC                             BANKMASK(TXSTA), 7
#define DATA_ADDRESS                     BANKMASK(SSPSTAT), 5
#define DC                               BANKMASK(STATUS), 1
#define D_A                              BANKMASK(SSPSTAT), 5
#define D_nA                             BANKMASK(SSPSTAT), 5
#define EEADRH0                          BANKMASK(EEADRH), 0
#define EEADRH1                          BANKMASK(EEADRH), 1
#define EEADRH2                          BANKMASK(EEADRH), 2
#define EEADRH3                          BANKMASK(EEADRH), 3
#define EEADRH4                          BANKMASK(EEADRH), 4
#define EEADRL0                          BANKMASK(EEADRL), 0
#define EEADRL1                          BANKMASK(EEADRL), 1
#define EEADRL2                          BANKMASK(EEADRL), 2
#define EEADRL3                          BANKMASK(EEADRL), 3
#define EEADRL4                          BANKMASK(EEADRL), 4
#define EEADRL5                          BANKMASK(EEADRL), 5
#define EEADRL6                          BANKMASK(EEADRL), 6
#define EEADRL7                          BANKMASK(EEADRL), 7
#define EEDATH0                          BANKMASK(EEDATH), 0
#define EEDATH1                          BANKMASK(EEDATH), 1
#define EEDATH2                          BANKMASK(EEDATH), 2
#define EEDATH3                          BANKMASK(EEDATH), 3
#define EEDATH4                          BANKMASK(EEDATH), 4
#define EEDATH5                          BANKMASK(EEDATH), 5
#define EEDATL0                          BANKMASK(EEDATL), 0
#define EEDATL1                          BANKMASK(EEDATL), 1
#define EEDATL2                          BANKMASK(EEDATL), 2
#define EEDATL3                          BANKMASK(EEDATL), 3
#define EEDATL4                          BANKMASK(EEDATL), 4
#define EEDATL5                          BANKMASK(EEDATL), 5
#define EEDATL6                          BANKMASK(EEDATL), 6
#define EEDATL7                          BANKMASK(EEDATL), 7
#define EEIE                             BANKMASK(PIE1), 7
#define EEIF                             BANKMASK(PIR1), 7
#define EEPGD                            BANKMASK(EECON1), 7
#define EERD                             BANKMASK(EECON1), 0
#define EEWR                             BANKMASK(EECON1), 1
#define FERR                             BANKMASK(RCSTA), 2
#define GIE                              BANKMASK(INTCON), 7
#define GO                               BANKMASK(ADCON0), 1
#define GO_DONE                          BANKMASK(ADCON0), 1
#define GO_nDONE                         BANKMASK(ADCON0), 1
#define HTS                              BANKMASK(OSCCON), 2
#define I2C_DATA                         BANKMASK(SSPSTAT), 5
#define I2C_READ                         BANKMASK(SSPSTAT), 2
#define I2C_START                        BANKMASK(SSPSTAT), 3
#define I2C_STOP                         BANKMASK(SSPSTAT), 4
#define INTE                             BANKMASK(INTCON), 4
#define INTEDG                           BANKMASK(OPTION_REG), 6
#define INTF                             BANKMASK(INTCON), 1
#define IOC4                             BANKMASK(IOCB), 4
#define IOC5                             BANKMASK(IOCB), 5
#define IOC6                             BANKMASK(IOCB), 6
#define IOC7                             BANKMASK(IOCB), 7
#define IOCB4                            BANKMASK(IOCB), 4
#define IOCB5                            BANKMASK(IOCB), 5
#define IOCB6                            BANKMASK(IOCB), 6
#define IOCB7                            BANKMASK(IOCB), 7
#define IRCF0                            BANKMASK(OSCCON), 4
#define IRCF1                            BANKMASK(OSCCON), 5
#define IRCF2                            BANKMASK(OSCCON), 6
#define IRVST                            BANKMASK(LVDCON), 5
#define LCDA                             BANKMASK(LCDPS), 5
#define LCDEN                            BANKMASK(LCDCON), 7
#define LCDIE                            BANKMASK(PIE2), 4
#define LCDIF                            BANKMASK(PIR2), 4
#define LMUX0                            BANKMASK(LCDCON), 0
#define LMUX1                            BANKMASK(LCDCON), 1
#define LP0                              BANKMASK(LCDPS), 0
#define LP1                              BANKMASK(LCDPS), 1
#define LP2                              BANKMASK(LCDPS), 2
#define LP3                              BANKMASK(LCDPS), 3
#define LTS                              BANKMASK(OSCCON), 1
#define LVDEN                            BANKMASK(LVDCON), 4
#define LVDIE                            BANKMASK(PIE2), 2
#define LVDIF                            BANKMASK(PIR2), 2
#define LVDL0                            BANKMASK(LVDCON), 0
#define LVDL1                            BANKMASK(LVDCON), 1
#define LVDL2                            BANKMASK(LVDCON), 2
#define OERR                             BANKMASK(RCSTA), 1
#define OSFIE                            BANKMASK(PIE2), 7
#define OSFIF                            BANKMASK(PIR2), 7
#define OSTS                             BANKMASK(OSCCON), 3
#define PEIE                             BANKMASK(INTCON), 6
#define PS0                              BANKMASK(OPTION_REG), 0
#define PS1                              BANKMASK(OPTION_REG), 1
#define PS2                              BANKMASK(OPTION_REG), 2
#define PSA                              BANKMASK(OPTION_REG), 3
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RA6                              BANKMASK(PORTA), 6
#define RA7                              BANKMASK(PORTA), 7
#define RB0                              BANKMASK(PORTB), 0
#define RB1                              BANKMASK(PORTB), 1
#define RB2                              BANKMASK(PORTB), 2
#define RB3                              BANKMASK(PORTB), 3
#define RB4                              BANKMASK(PORTB), 4
#define RB5                              BANKMASK(PORTB), 5
#define RB6                              BANKMASK(PORTB), 6
#define RB7                              BANKMASK(PORTB), 7
#define RBIE                             BANKMASK(INTCON), 3
#define RBIF                             BANKMASK(INTCON), 0
#define RC0                              BANKMASK(PORTC), 0
#define RC1                              BANKMASK(PORTC), 1
#define RC2                              BANKMASK(PORTC), 2
#define RC3                              BANKMASK(PORTC), 3
#define RC4                              BANKMASK(PORTC), 4
#define RC5                              BANKMASK(PORTC), 5
#define RC6                              BANKMASK(PORTC), 6
#define RC7                              BANKMASK(PORTC), 7
#define RC8_9                            BANKMASK(RCSTA), 6
#define RC9                              BANKMASK(RCSTA), 6
#define RCD8                             BANKMASK(RCSTA), 0
#define RCIE                             BANKMASK(PIE1), 5
#define RCIF                             BANKMASK(PIR1), 5
#define RD                               BANKMASK(EECON1), 0
#define RE3                              BANKMASK(PORTE), 3
#define READ_WRITE                       BANKMASK(SSPSTAT), 2
#define RP0                              BANKMASK(STATUS), 5
#define RP1                              BANKMASK(STATUS), 6
#define RX9                              BANKMASK(RCSTA), 6
#define RX9D                             BANKMASK(RCSTA), 0
#define R_W                              BANKMASK(SSPSTAT), 2
#define R_nW                             BANKMASK(SSPSTAT), 2
#define S0C0                             BANKMASK(LCDDATA0), 0
#define S0C1                             BANKMASK(LCDDATA3), 0
#define S0C2                             BANKMASK(LCDDATA6), 0
#define S0C3                             BANKMASK(LCDDATA9), 0
#define S10C0                            BANKMASK(LCDDATA1), 2
#define S10C1                            BANKMASK(LCDDATA4), 2
#define S10C2                            BANKMASK(LCDDATA7), 2
#define S10C3                            BANKMASK(LCDDATA10), 2
#define S11C0                            BANKMASK(LCDDATA1), 3
#define S11C1                            BANKMASK(LCDDATA4), 3
#define S11C2                            BANKMASK(LCDDATA7), 3
#define S11C3                            BANKMASK(LCDDATA10), 3
#define S12C0                            BANKMASK(LCDDATA1), 4
#define S12C1                            BANKMASK(LCDDATA4), 4
#define S12C2                            BANKMASK(LCDDATA7), 4
#define S12C3                            BANKMASK(LCDDATA10), 4
#define S13C0                            BANKMASK(LCDDATA1), 5
#define S13C1                            BANKMASK(LCDDATA4), 5
#define S13C2                            BANKMASK(LCDDATA7), 5
#define S13C3                            BANKMASK(LCDDATA10), 5
#define S14C0                            BANKMASK(LCDDATA1), 6
#define S14C1                            BANKMASK(LCDDATA4), 6
#define S14C2                            BANKMASK(LCDDATA7), 6
#define S14C3                            BANKMASK(LCDDATA10), 6
#define S15C0                            BANKMASK(LCDDATA1), 7
#define S15C1                            BANKMASK(LCDDATA4), 7
#define S15C2                            BANKMASK(LCDDATA7), 7
#define S15C3                            BANKMASK(LCDDATA10), 7
#define S1C0                             BANKMASK(LCDDATA0), 1
#define S1C1                             BANKMASK(LCDDATA3), 1
#define S1C2                             BANKMASK(LCDDATA6), 1
#define S1C3                             BANKMASK(LCDDATA9), 1
#define S2C0                             BANKMASK(LCDDATA0), 2
#define S2C1                             BANKMASK(LCDDATA3), 2
#define S2C2                             BANKMASK(LCDDATA6), 2
#define S2C3                             BANKMASK(LCDDATA9), 2
#define S3C0                             BANKMASK(LCDDATA0), 3
#define S3C1                             BANKMASK(LCDDATA3), 3
#define S3C2                             BANKMASK(LCDDATA6), 3
#define S3C3                             BANKMASK(LCDDATA9), 3
#define S4C0                             BANKMASK(LCDDATA0), 4
#define S4C1                             BANKMASK(LCDDATA3), 4
#define S4C2                             BANKMASK(LCDDATA6), 4
#define S4C3                             BANKMASK(LCDDATA9), 4
#define S5C0                             BANKMASK(LCDDATA0), 5
#define S5C1                             BANKMASK(LCDDATA3), 5
#define S5C2                             BANKMASK(LCDDATA6), 5
#define S5C3                             BANKMASK(LCDDATA9), 5
#define S6C0                             BANKMASK(LCDDATA0), 6
#define S6C1                             BANKMASK(LCDDATA3), 6
#define S6C2                             BANKMASK(LCDDATA6), 6
#define S6C3                             BANKMASK(LCDDATA9), 6
#define S7C0                             BANKMASK(LCDDATA0), 7
#define S7C1                             BANKMASK(LCDDATA3), 7
#define S7C2                             BANKMASK(LCDDATA6), 7
#define S7C3                             BANKMASK(LCDDATA9), 7
#define S8C0                             BANKMASK(LCDDATA1), 0
#define S8C1                             BANKMASK(LCDDATA4), 0
#define S8C2                             BANKMASK(LCDDATA7), 0
#define S8C3                             BANKMASK(LCDDATA10), 0
#define S9C0                             BANKMASK(LCDDATA1), 1
#define S9C1                             BANKMASK(LCDDATA4), 1
#define S9C2                             BANKMASK(LCDDATA7), 1
#define S9C3                             BANKMASK(LCDDATA10), 1
#define SBOREN                           BANKMASK(PCON), 4
#define SCS                              BANKMASK(OSCCON), 0
#define SE0                              BANKMASK(LCDSE0), 0
#define SE1                              BANKMASK(LCDSE0), 1
#define SE10                             BANKMASK(LCDSE1), 2
#define SE11                             BANKMASK(LCDSE1), 3
#define SE12                             BANKMASK(LCDSE1), 4
#define SE13                             BANKMASK(LCDSE1), 5
#define SE14                             BANKMASK(LCDSE1), 6
#define SE15                             BANKMASK(LCDSE1), 7
#define SE2                              BANKMASK(LCDSE0), 2
#define SE3                              BANKMASK(LCDSE0), 3
#define SE4                              BANKMASK(LCDSE0), 4
#define SE5                              BANKMASK(LCDSE0), 5
#define SE6                              BANKMASK(LCDSE0), 6
#define SE7                              BANKMASK(LCDSE0), 7
#define SE8                              BANKMASK(LCDSE1), 0
#define SE9                              BANKMASK(LCDSE1), 1
#define SEG0COM0                         BANKMASK(LCDDATA0), 0
#define SEG0COM1                         BANKMASK(LCDDATA3), 0
#define SEG0COM2                         BANKMASK(LCDDATA6), 0
#define SEG0COM3                         BANKMASK(LCDDATA9), 0
#define SEG10COM0                        BANKMASK(LCDDATA1), 2
#define SEG10COM1                        BANKMASK(LCDDATA4), 2
#define SEG10COM2                        BANKMASK(LCDDATA7), 2
#define SEG10COM3                        BANKMASK(LCDDATA10), 2
#define SEG11COM0                        BANKMASK(LCDDATA1), 3
#define SEG11COM1                        BANKMASK(LCDDATA4), 3
#define SEG11COM2                        BANKMASK(LCDDATA7), 3
#define SEG11COM3                        BANKMASK(LCDDATA10), 3
#define SEG12COM0                        BANKMASK(LCDDATA1), 4
#define SEG12COM1                        BANKMASK(LCDDATA4), 4
#define SEG12COM2                        BANKMASK(LCDDATA7), 4
#define SEG12COM3                        BANKMASK(LCDDATA10), 4
#define SEG13COM0                        BANKMASK(LCDDATA1), 5
#define SEG13COM1                        BANKMASK(LCDDATA4), 5
#define SEG13COM2                        BANKMASK(LCDDATA7), 5
#define SEG13COM3                        BANKMASK(LCDDATA10), 5
#define SEG14COM0                        BANKMASK(LCDDATA1), 6
#define SEG14COM1                        BANKMASK(LCDDATA4), 6
#define SEG14COM2                        BANKMASK(LCDDATA7), 6
#define SEG14COM3                        BANKMASK(LCDDATA10), 6
#define SEG15COM0                        BANKMASK(LCDDATA1), 7
#define SEG15COM1                        BANKMASK(LCDDATA4), 7
#define SEG15COM2                        BANKMASK(LCDDATA7), 7
#define SEG15COM3                        BANKMASK(LCDDATA10), 7
#define SEG1COM0                         BANKMASK(LCDDATA0), 1
#define SEG1COM1                         BANKMASK(LCDDATA3), 1
#define SEG1COM2                         BANKMASK(LCDDATA6), 1
#define SEG1COM3                         BANKMASK(LCDDATA9), 1
#define SEG2COM0                         BANKMASK(LCDDATA0), 2
#define SEG2COM1                         BANKMASK(LCDDATA3), 2
#define SEG2COM2                         BANKMASK(LCDDATA6), 2
#define SEG2COM3                         BANKMASK(LCDDATA9), 2
#define SEG3COM0                         BANKMASK(LCDDATA0), 3
#define SEG3COM1                         BANKMASK(LCDDATA3), 3
#define SEG3COM2                         BANKMASK(LCDDATA6), 3
#define SEG3COM3                         BANKMASK(LCDDATA9), 3
#define SEG4COM0                         BANKMASK(LCDDATA0), 4
#define SEG4COM1                         BANKMASK(LCDDATA3), 4
#define SEG4COM2                         BANKMASK(LCDDATA6), 4
#define SEG4COM3                         BANKMASK(LCDDATA9), 4
#define SEG5COM0                         BANKMASK(LCDDATA0), 5
#define SEG5COM1                         BANKMASK(LCDDATA3), 5
#define SEG5COM2                         BANKMASK(LCDDATA6), 5
#define SEG5COM3                         BANKMASK(LCDDATA9), 5
#define SEG6COM0                         BANKMASK(LCDDATA0), 6
#define SEG6COM1                         BANKMASK(LCDDATA3), 6
#define SEG6COM2                         BANKMASK(LCDDATA6), 6
#define SEG6COM3                         BANKMASK(LCDDATA9), 6
#define SEG7COM0                         BANKMASK(LCDDATA0), 7
#define SEG7COM1                         BANKMASK(LCDDATA3), 7
#define SEG7COM2                         BANKMASK(LCDDATA6), 7
#define SEG7COM3                         BANKMASK(LCDDATA9), 7
#define SEG8COM0                         BANKMASK(LCDDATA1), 0
#define SEG8COM1                         BANKMASK(LCDDATA4), 0
#define SEG8COM2                         BANKMASK(LCDDATA7), 0
#define SEG8COM3                         BANKMASK(LCDDATA10), 0
#define SEG9COM0                         BANKMASK(LCDDATA1), 1
#define SEG9COM1                         BANKMASK(LCDDATA4), 1
#define SEG9COM2                         BANKMASK(LCDDATA7), 1
#define SEG9COM3                         BANKMASK(LCDDATA10), 1
#define SEGEN0                           BANKMASK(LCDSE0), 0
#define SEGEN1                           BANKMASK(LCDSE0), 1
#define SEGEN10                          BANKMASK(LCDSE1), 2
#define SEGEN11                          BANKMASK(LCDSE1), 3
#define SEGEN12                          BANKMASK(LCDSE1), 4
#define SEGEN13                          BANKMASK(LCDSE1), 5
#define SEGEN14                          BANKMASK(LCDSE1), 6
#define SEGEN15                          BANKMASK(LCDSE1), 7
#define SEGEN2                           BANKMASK(LCDSE0), 2
#define SEGEN3                           BANKMASK(LCDSE0), 3
#define SEGEN4                           BANKMASK(LCDSE0), 4
#define SEGEN5                           BANKMASK(LCDSE0), 5
#define SEGEN6                           BANKMASK(LCDSE0), 6
#define SEGEN7                           BANKMASK(LCDSE0), 7
#define SEGEN8                           BANKMASK(LCDSE1), 0
#define SEGEN9                           BANKMASK(LCDSE1), 1
#define SLPEN                            BANKMASK(LCDCON), 6
#define SMP                              BANKMASK(SSPSTAT), 7
#define SPEN                             BANKMASK(RCSTA), 7
#define SREN                             BANKMASK(RCSTA), 5
#define SSPEN                            BANKMASK(SSPCON), 5
#define SSPIE                            BANKMASK(PIE1), 3
#define SSPIF                            BANKMASK(PIR1), 3
#define SSPM0                            BANKMASK(SSPCON), 0
#define SSPM1                            BANKMASK(SSPCON), 1
#define SSPM2                            BANKMASK(SSPCON), 2
#define SSPM3                            BANKMASK(SSPCON), 3
#define SSPOV                            BANKMASK(SSPCON), 6
#define SWDTE                            BANKMASK(WDTCON), 0
#define SWDTEN                           BANKMASK(WDTCON), 0
#define SYNC                             BANKMASK(TXSTA), 4
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1GE                             BANKMASK(T1CON), 6
#define T1GINV                           BANKMASK(T1CON), 7
#define T1GSS                            BANKMASK(CMCON1), 1
#define T1INSYNC                         BANKMASK(T1CON), 2
#define T1OSCEN                          BANKMASK(T1CON), 3
#define T1SYNC                           BANKMASK(T1CON), 2
#define T2CKPS0                          BANKMASK(T2CON), 0
#define T2CKPS1                          BANKMASK(T2CON), 1
#define TMR0IE                           BANKMASK(INTCON), 5
#define TMR0IF                           BANKMASK(INTCON), 2
#define TMR1CS                           BANKMASK(T1CON), 1
#define TMR1GE                           BANKMASK(T1CON), 6
#define TMR1IE                           BANKMASK(PIE1), 0
#define TMR1IF                           BANKMASK(PIR1), 0
#define TMR1ON                           BANKMASK(T1CON), 0
#define TMR2IE                           BANKMASK(PIE1), 1
#define TMR2IF                           BANKMASK(PIR1), 1
#define TMR2ON                           BANKMASK(T2CON), 2
#define TOUTPS0                          BANKMASK(T2CON), 3
#define TOUTPS1                          BANKMASK(T2CON), 4
#define TOUTPS2                          BANKMASK(T2CON), 5
#define TOUTPS3                          BANKMASK(T2CON), 6
#define TRISA0                           BANKMASK(TRISA), 0
#define TRISA1                           BANKMASK(TRISA), 1
#define TRISA2                           BANKMASK(TRISA), 2
